Store/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
// Товары количество при изменении.
// 
// Параметры:
//  Элемент - ПолеФормы - Элемент
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекстСообщения = "Изменилась Количество";
	
	ПересчетСтроки(ТекущиеДанные, ТекстСообщения);
	
КонецПроцедуры

// Пересчет строки.
// 
// Параметры:
//  СтрокаНоменклатуры - ДанныеФормыЭлементКоллекции - Строка номенклатуры
//  СообщениеПользователю - Строка - Сообщение пользователю
&НаКлиенте
Процедура ПересчетСтроки(СтрокаНоменклатуры, СообщениеПользователю)
	СтрокаНоменклатуры.Сумма = СтрокаНоменклатуры.Цена * СтрокаНоменклатуры.Количество;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = (СообщениеПользователю);
	Сообщение.Сообщить();
	
	Пользователь = ОписаниеПользователя();
КонецПроцедуры

// Описание пользователя.
// 
// Возвращаемое значение:
//  Структура - Описание пользователя:
// * Имя - Строка - 
// * ДатаРождения - Дата - 
// * Штатный - Булево - 
&НаКлиенте
Функция ОписаниеПользователя()
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	Человек.Вставить("Штатный", Истина);	

	Возврат Человек;
КонецФункции

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекстСообщения = "Изменилась цена";
	
	ПересчетСтроки(ТекущиеДанные, ТекстСообщения);
	
КонецПроцедуры
